# python中常见的数据结构有：
# 1. ————————————————————————————————列表————————————————————————————————
list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 0]

# 打印列表
print(list1)

# 获取列表的长度
a = len(list1)
print(a)

# ————————————————————————————————修改列表中的元素
list1[5] = 'puzhibin'
print(list1)

# ————————————————————————————————列表新增元素
list1.insert(22, '54321')  # 插入元素
print(list1)
list1.append(123)  # 末尾添加元素
print(list1)

# ————————————————————————————————列表中遍历出字符串并删除所有字符串
for i in list1:
    if type(i) == str:
        list1.remove(i)
print(list1)

# ————————————————————————————————列表中遍历出 int 的内容,并赋值给list2
list2 = []
for i in list1:
    if type != int:
        list2.append(i)
print(list2)

# ————————————————————————————————列表从小到大排列
list2.reverse()  # 要么是数字，要么是字符串
print("从小到大：", list2)

# ————————————————————————————————列表从大到下排列
list2.sort()  # 要么是数字，要么是字符串
print("从大到小：", list2)

# ————————————————————————————————拼接列表
list01 = [1,23,34,55,22,2,4,5,6]
list02 = [3,4,5,22,3,5,46,467,474,221,1]
list3 = list01+ list02
list3.sort()
print("拼接后的列表：",list3)


# 总结：列表是一个有序的集合，可以包含任意类型的元素，使用方括号[] 来定义。
# 支持索引、切片、拼接灯操作。
